backend: tensorflow
class_name: Sequential
config:
  build_input_shape: !!python/tuple [null, 28, 28]
  layers:
  - class_name: Reshape
    config:
      dtype: float32
      name: reshape_1
      target_shape: !!python/tuple [28, 28, 1]
      trainable: true
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      dtype: float32
      filters: 12
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_1
      padding: valid
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: true
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.25, seed: null,
      trainable: true}
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 24
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_2
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
  - class_name: Dropout
    config: {dtype: float32, name: dropout_2, noise_shape: null, rate: 0.25, seed: null,
      trainable: true}
  - class_name: BinaryConv2D
    config:
      H: 1.0
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_lr_multiplier: null
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint:
        class_name: Clip
        config: {max_value: 1.0, min_value: -1.0}
      kernel_initializer:
        class_name: RandomUniform
        config: {maxval: 1.0, minval: -1.0, seed: null}
      kernel_lr_multiplier: !!python/object/apply:numpy.core.multiarray.scalar
      - &id002 !!python/object/apply:numpy.dtype
        args: [f4, 0, 1]
        state: !!python/tuple [3, <, null, null, null, -1, -1, 0]
      - !!binary |
        dqSSQQ==
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: binary_conv2d_1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
  - class_name: Dropout
    config: {dtype: float32, name: dropout_3, noise_shape: null, rate: 0.25, seed: null,
      trainable: true}
  - class_name: Flatten
    config: {data_format: channels_last, dtype: float32, name: flatten_1, trainable: true}
  - class_name: BinaryDense
    config:
      H: 1.0
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_lr_multiplier: null
      bias_regularizer: null
      dtype: float32
      kernel_constraint:
        class_name: Clip
        config: {max_value: 1.0, min_value: -1.0}
      kernel_initializer:
        class_name: RandomUniform
        config: {maxval: 1.0, minval: -1.0, seed: null}
      kernel_lr_multiplier: !!python/object/apply:numpy.core.multiarray.scalar
      - *id002
      - !!binary |
        Io/OQQ==
      kernel_regularizer: null
      name: binary_dense_2
      trainable: true
      units: 200
      use_bias: false
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 10
      use_bias: true
  name: sequential_1
keras_version: 2.2.5
